# YOLOv9

# parameters
nc: 10  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3

# gelan backbone
backbone:
  [
   # conv down
   [-1, 1, Conv, [64, 3, 2]],  # 0-P1/2

   # conv down
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  # 2


   # avg-conv down
   [-1, 1, DWdown, [256]],  # 3-P3/8

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],  # 4


   # avg-conv down
   [-1, 1, DWdown, [512]],  # 5-P4/16

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 6


  ]

# gelan head
head:
  [
   # elan-spp block
   [-1, 1, RSPPPELAN, [512, 256]],  # 7

   # up-Concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],


   [[-1, 4], 1, Concat, [1]],  # cat backbone P3

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  # 10 
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #11
   [[-1, 2], 1, Concat, [1]],  # cat backbone P2 # 12
   
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 1]],  # 13 (P3/8-small)
   # avg-conv-down merge
   [-1, 1, DWdown, [256]],
   [[-1, 10], 1, Concat, [1]],  # cat head P4

   [-1, 1, RepNCSPELAN4, [128 ,128 ,64, 1]],  # 16 (P3/8-small)

   # avg-conv-down merge
   [-1, 1, DWdown, [256]],
   [[-1, 7], 1, Concat, [1]],  # cat head P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 19 (P4/16-medium)


   # detect
   [[13,16,19], 1, DDetect, [nc]],  # DDetect(P3, P4, P5)
  ]
